exp_roomWT/nv_hotRoom2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    building
    {
        type            wall;
        physicalType    patch;
        nFaces          1220;
        startFace       10206;
    }
    buibottom
    {
        type            wall;
        physicalType    patch;
        nFaces          244;
        startFace       11426;
    }
    window
    {
        type            wall;
        physicalType    patch;
        nFaces          0;
        startFace       11670;
    }
    inlet
    {
        type            wall;
        physicalType    patch;
        nFaces          50;
        startFace       11670;
    }
    bottom
    {
        type            wall;
        physicalType    patch;
        nFaces          134;
        startFace       11720;
    }
    sides
    {
        type            wall;
        physicalType    patch;
        nFaces          208;
        startFace       11854;
    }
    top
    {
        type            wall;
        physicalType    patch;
        nFaces          74;
        startFace       12062;
    }
    defaultFaces
    {
        type            wall;
        nFaces          50;
        startFace       12136;
    }
)

// ************************************************************************* //
