exp_roomWT/nv_hotRoom2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    // not specifying window 
    building
    {
        type            noSlip; // wall
    }

    buibottom
    {
        type            noSlip; // wall
    }
    inlet { // from icoFoam/elbow example ...
        type            fixedValue;
        value           uniform (1 0 0);
    }

    bottom
    {
        type            noSlip; // wall
    }

    sides
    {
        type            slip; // wall
    }

    top
    {
        type            slip; // wall
    }
    window
    {
        type            slip; // wall
    }

    defaultFaces
    {
        type            slip; // wall
    }
}

// ************************************************************************* //


