exp_roomWT/nv_hotRoom2/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    building
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    buibottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    sides
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    top
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    window
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    defaultFaces
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
