exp_roomWT/nv_hotRoom2/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    building
    {
        type            zeroGradient;
    }

    buibottom
    {
        type            zeroGradient;
    }
    inlet {
        type            fixedValue;
        value           uniform 300;
    }

    bottom
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }

    top
    {
        type           zeroGradient;
    }
    window
    {
        type           zeroGradient;
    }
    defaultFaces
    {
        type           zeroGradient;
    }

}

// ************************************************************************* //
